{
    "iteration": 4,
    "metrics": {
        "0": {
            "precision": 0.9090909090909091,
            "recall": 0.1986754966887417,
            "f1-score": 0.32608695652173914,
            "support": 151.0
        },
        "1": {
            "precision": 0.8771929824561403,
            "recall": 0.8620689655172413,
            "f1-score": 0.8695652173913043,
            "support": 58.0
        },
        "2": {
            "precision": 0.8314606741573034,
            "recall": 0.9024390243902439,
            "f1-score": 0.8654970760233918,
            "support": 82.0
        },
        "3": {
            "precision": 0.8478260869565217,
            "recall": 0.8210526315789474,
            "f1-score": 0.8342245989304813,
            "support": 95.0
        },
        "4": {
            "precision": 0.8831168831168831,
            "recall": 0.7727272727272727,
            "f1-score": 0.8242424242424242,
            "support": 88.0
        },
        "5": {
            "precision": 0.7857142857142857,
            "recall": 0.9072164948453608,
            "f1-score": 0.8421052631578947,
            "support": 97.0
        },
        "6": {
            "precision": 0.3862433862433862,
            "recall": 0.9358974358974359,
            "f1-score": 0.5468164794007491,
            "support": 78.0
        },
        "7": {
            "precision": 0.0,
            "recall": 0.0,
            "f1-score": 0.0,
            "support": 0.0
        },
        "8": {
            "precision": 0.0,
            "recall": 0.0,
            "f1-score": 0.0,
            "support": 0.0
        },
        "9": {
            "precision": 0.0,
            "recall": 0.0,
            "f1-score": 0.0,
            "support": 0.0
        },
        "10": {
            "precision": 0.0,
            "recall": 0.0,
            "f1-score": 0.0,
            "support": 0.0
        },
        "accuracy": 0.7103235747303543,
        "macro avg": {
            "precision": 0.5018768370668572,
            "recall": 0.49091612014956765,
            "f1-score": 0.4644125468789077,
            "support": 649.0
        },
        "weighted avg": {
            "precision": 0.8026636815909205,
            "recall": 0.7103235747303543,
            "f1-score": 0.6883901994278885,
            "support": 649.0
        }
    },
    "model_config": {
        "name": "functional_1",
        "trainable": true,
        "layers": [
            {
                "module": "keras.layers",
                "class_name": "InputLayer",
                "config": {
                    "batch_shape": [
                        null,
                        224,
                        224,
                        3
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "input_layer_3"
                },
                "registered_name": null,
                "name": "input_layer_3",
                "inbound_nodes": []
            },
            {
                "module": "keras.src.models.functional",
                "class_name": "Functional",
                "config": {
                    "name": "MobileNetV3Large",
                    "trainable": false,
                    "layers": [
                        {
                            "module": "keras.layers",
                            "class_name": "InputLayer",
                            "config": {
                                "batch_shape": [
                                    null,
                                    224,
                                    224,
                                    3
                                ],
                                "dtype": "float32",
                                "sparse": false,
                                "name": "input_layer_2"
                            },
                            "registered_name": null,
                            "name": "input_layer_2",
                            "inbound_nodes": []
                        },
                        {
                            "module": "keras.src.ops.core",
                            "class_name": "Cast",
                            "config": {
                                "dtype": "float16"
                            },
                            "registered_name": "Cast",
                            "name": "cast_3",
                            "inbound_nodes": [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    224,
                                                    224,
                                                    3
                                                ],
                                                "dtype": "float32",
                                                "keras_history": [
                                                    "input_layer_2",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "Rescaling",
                            "config": {
                                "name": "rescaling_1",
                                "trainable": false,
                                "dtype": {
                                    "module": "keras",
                                    "class_name": "DTypePolicy",
                                    "config": {
                                        "name": "mixed_float16"
                                    },
                                    "registered_name": null
                                },
                                "scale": 0.00784313725490196,
                                "offset": -1.0
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    224,
                                    224,
                                    3
                                ]
                            },
                            "name": "rescaling_1",
                            "inbound_nodes": [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    224,
                                                    224,
                                                    3
                                                ],
                                                "dtype": "float16",
                                                "keras_history": [
                                                    "cast_3",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv",
                                "trainable": false,
                                "dtype": {
                                    "module": "keras",
                                    "class_name": "DTypePolicy",
                                    "config": {
                                        "name": "mixed_float16"
                                    },
                                    "registered_name": null
                                },
                                "filters": 16,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    2,
                                    2
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "groups": 1,
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    },
                                    "registered_name": null
                                },
                                "bias_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    224,
                                    224,
                                    3
                                ]
                            },
                            "name": "conv",
                            "inbound_nodes": [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    224,
                                                    224,
                                                    3
                                                ],
                                                "dtype": "float16",
                                                "keras_history": [
                                                    "rescaling_1",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "conv_bn",
                                "trainable": false,
                                "dtype": {
                                    "module": "keras",
                                    "class_name": "DTypePolicy",
                                    "config": {
                                        "name": "mixed_float16"
                                    },
                                    "registered_name": null
                                },
                                "axis": -1,
                                "momentum": 0.999,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "gamma_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Ones",
                                    "config": {},
                                    "registered_name": null
                                },
                                "moving_mean_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "moving_variance_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Ones",
                                    "config": {},
                                    "registered_name": null
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null,
                                "synchronized": false
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    112,
                                    112,
                                    16
                                ]
                            },
                            "name": "conv_bn",
                            "inbound_nodes": [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    112,
                                                    112,
                                                    16
                                                ],
                                                "dtype": "float16",
                                                "keras_history": [
                                                    "conv",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {
                                        "mask": null
                                    }
                                }
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "Activation",
                            "config": {
                                "name": "activation_21",
                                "trainable": false,
                                "dtype": {
                                    "module": "keras",
                                    "class_name": "DTypePolicy",
                                    "config": {
                                        "name": "mixed_float16"
                                    },
                                    "registered_name": null
                                },
                                "activation": "hard_silu"
                            },
                            "registered_name": null,
                            "name": "activation_21",
                            "inbound_nodes": [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    112,
                                                    112,
                                                    16
                                                ],
                                                "dtype": "float16",
                                                "keras_history": [
                                                    "conv_bn",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "DepthwiseConv2D",
                            "config": {
                                "name": "expanded_conv_depthwise",
                                "trainable": false,
                                "dtype": {
                                    "module": "keras",
                                    "class_name": "DTypePolicy",
                                    "config": {
                                        "name": "mixed_float16"
                                    },
                                    "registered_name": null
                                },
                                "depth_multiplier": 1,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": false,
                                "depthwise_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    },
                                    "registered_name": null
                                },
                                "bias_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "depthwise_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "depthwise_constraint": null,
                                "bias_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    112,
                                    112,
                                    16
                                ]
                            },
                            "name": "expanded_conv_depthwise",
                            "inbound_nodes": [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    112,
                                                    112,
                                                    16
                                                ],
                                                "dtype": "float16",
                                                "keras_history": [
                                                    "activation_21",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "expanded_conv_depthwise_bn",
                                "trainable": false,
                                "dtype": {
                                    "module": "keras",
                                    "class_name": "DTypePolicy",
                                    "config": {
                                        "name": "mixed_float16"
                                    },
                                    "registered_name": null
                                },
                                "axis": -1,
                                "momentum": 0.999,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "gamma_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Ones",
                                    "config": {},
                                    "registered_name": null
                                },
                                "moving_mean_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "moving_variance_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Ones",
                                    "config": {},
                                    "registered_name": null
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null,
                                "synchronized": false
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    112,
                                    112,
                                    16
                                ]
                            },
                            "name": "expanded_conv_depthwise_bn",
                            "inbound_nodes": [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    112,
                                                    112,
                                                    16
                                                ],
                                                "dtype": "float16",
                                                "keras_history": [
                                                    "expanded_conv_depthwise",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {
                                        "mask": null
                                    }
                                }
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "ReLU",
                            "config": {
                                "name": "re_lu_19",
                                "trainable": false,
                                "dtype": {
                                    "module": "keras",
                                    "class_name": "DTypePolicy",
                                    "config": {
                                        "name": "mixed_float16"
                                    },
                                    "registered_name": null
                                },
                                "max_value": null,
                                "negative_slope": 0.0,
                                "threshold": 0.0
                            },
                            "registered_name": null,
                            "name": "re_lu_19",
                            "inbound_nodes": [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    112,
                                                    112,
                                                    16
                                                ],
                                                "dtype": "float16",
                                                "keras_history": [
                                                    "expanded_conv_depthwise_bn",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "Conv2D",
                            "config": {
                                "name": "expanded_conv_project",
                                "trainable": false,
                                "dtype": {
                                    "module": "keras",
                                    "class_name": "DTypePolicy",
                                    "config": {
                                        "name": "mixed_float16"
                                    },
                                    "registered_name": null
                                },
                                "filters": 16,
                                "kernel_size": [
                                    1,
                                    1
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "groups": 1,
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    },
                                    "registered_name": null
                                },
                                "bias_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    112,
                                    112,
                                    16
                                ]
                            },
                            "name": "expanded_conv_project",
                            "inbound_nodes": [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    112,
                                                    112,
                                                    16
                                                ],
                                                "dtype": "float16",
                                                "keras_history": [
                                                    "re_lu_19",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "expanded_conv_project_bn",
                                "trainable": false,
                                "dtype": {
                                    "module": "keras",
                                    "class_name": "DTypePolicy",
                                    "config": {
                                        "name": "mixed_float16"
                                    },
                                    "registered_name": null
                                },
                                "axis": -1,
                                "momentum": 0.999,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "gamma_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Ones",
                                    "config": {},
                                    "registered_name": null
                                },
                                "moving_mean_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "moving_variance_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Ones",
                                    "config": {},
                                    "registered_name": null
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null,
                                "synchronized": false
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    112,
                                    112,
                                    16
                                ]
                            },
                            "name": "expanded_conv_project_bn",
                            "inbound_nodes": [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    112,
                                                    112,
                                                    16
                                                ],
                                                "dtype": "float16",
                                                "keras_history": [
                                                    "expanded_conv_project",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {
                                        "mask": null
                                    }
                                }
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "Add",
                            "config": {
                                "name": "expanded_conv_add",
                                "trainable": false,
                                "dtype": {
                                    "module": "keras",
                                    "class_name": "DTypePolicy",
                                    "config": {
                                        "name": "mixed_float16"
                                    },
                                    "registered_name": null
                                }
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    [
                                        null,
                                        112,
                                        112,
                                        16
                                    ],
                                    [
                                        null,
                                        112,
                                        112,
                                        16
                                    ]
                                ]
                            },
                            "name": "expanded_conv_add",
                            "inbound_nodes": [
                                {
                                    "args": [
                                        [
                                            {
                                                "class_name": "__keras_tensor__",
                                                "config": {
                                                    "shape": [
                                                        null,
                                                        112,
                                                        112,
                                                        16
                                                    ],
                                                    "dtype": "float16",
                                                    "keras_history": [
                                                        "activation_21",
                                                        0,
                                                        0
                                                    ]
                                                }
                                            },
                                            {
                                                "class_name": "__keras_tensor__",
                                                "config": {
                                                    "shape": [
                                                        null,
                                                        112,
                                                        112,
                                                        16
                                                    ],
                                                    "dtype": "float16",
                                                    "keras_history": [
                                                        "expanded_conv_project_bn",
                                                        0,
                                                        0
                                                    ]
                                                }
                                            }
                                        ]
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "Conv2D",
                            "config": {
                                "name": "expanded_conv_1_expand",
                                "trainable": false,
                                "dtype": {
                                    "module": "keras",
                                    "class_name": "DTypePolicy",
                                    "config": {
                                        "name": "mixed_float16"
                                    },
                                    "registered_name": null
                                },
                                "filters": 64,
                                "kernel_size": [
                                    1,
                                    1
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "groups": 1,
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    },
                                    "registered_name": null
                                },
                                "bias_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    112,
                                    112,
                                    16
                                ]
                            },
                            "name": "expanded_conv_1_expand",
                            "inbound_nodes": [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    112,
                                                    112,
                                                    16
                                                ],
                                                "dtype": "float16",
                                                "keras_history": [
                                                    "expanded_conv_add",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "expanded_conv_1_expand_bn",
                                "trainable": false,
                                "dtype": {
                                    "module": "keras",
                                    "class_name": "DTypePolicy",
                                    "config": {
                                        "name": "mixed_float16"
                                    },
                                    "registered_name": null
                                },
                                "axis": -1,
                                "momentum": 0.999,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "gamma_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Ones",
                                    "config": {},
                                    "registered_name": null
                                },
                                "moving_mean_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "moving_variance_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Ones",
                                    "config": {},
                                    "registered_name": null
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null,
                                "synchronized": false
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    112,
                                    112,
                                    64
                                ]
                            },
                            "name": "expanded_conv_1_expand_bn",
                            "inbound_nodes": [
                                {
                                    "args": [
                                        {
