{
    "iteration": 5,
    "metrics": {
        "0": {
            "precision": 0.8823529411764706,
            "recall": 0.189873417721519,
            "f1-score": 0.3125,
            "support": 158.0
        },
        "1": {
            "precision": 0.9230769230769231,
            "recall": 0.8275862068965517,
            "f1-score": 0.8727272727272727,
            "support": 58.0
        },
        "2": {
            "precision": 0.9036144578313253,
            "recall": 0.9146341463414634,
            "f1-score": 0.9090909090909091,
            "support": 82.0
        },
        "3": {
            "precision": 0.8762886597938144,
            "recall": 0.8947368421052632,
            "f1-score": 0.8854166666666666,
            "support": 95.0
        },
        "4": {
            "precision": 0.8734177215189873,
            "recall": 0.7840909090909091,
            "f1-score": 0.8263473053892215,
            "support": 88.0
        },
        "5": {
            "precision": 0.7964601769911505,
            "recall": 0.9278350515463918,
            "f1-score": 0.8571428571428571,
            "support": 97.0
        },
        "6": {
            "precision": 0.3686868686868687,
            "recall": 0.9358974358974359,
            "f1-score": 0.5289855072463768,
            "support": 78.0
        },
        "7": {
            "precision": 0.0,
            "recall": 0.0,
            "f1-score": 0.0,
            "support": 0.0
        },
        "8": {
            "precision": 0.0,
            "recall": 0.0,
            "f1-score": 0.0,
            "support": 0.0
        },
        "9": {
            "precision": 0.0,
            "recall": 0.0,
            "f1-score": 0.0,
            "support": 0.0
        },
        "10": {
            "precision": 0.0,
            "recall": 0.0,
            "f1-score": 0.0,
            "support": 0.0
        },
        "11": {
            "precision": 0.0,
            "recall": 0.0,
            "f1-score": 0.0,
            "support": 0.0
        },
        "12": {
            "precision": 0.0,
            "recall": 0.0,
            "f1-score": 0.0,
            "support": 0.0
        },
        "accuracy": 0.7164634146341463,
        "macro avg": {
            "precision": 0.4326075191596569,
            "recall": 0.42112723150765646,
            "f1-score": 0.3994008090971772,
            "support": 656.0
        },
        "weighted avg": {
            "precision": 0.8127576324486481,
            "recall": 0.7164634146341463,
            "f1-score": 0.6947797397550239,
            "support": 656.0
        }
    },
    "model_config": {
        "name": "functional_5",
        "trainable": true,
        "layers": [
            {
                "module": "keras.layers",
                "class_name": "InputLayer",
                "config": {
                    "batch_shape": [
                        null,
                        224,
                        224,
                        3
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "input_layer_11"
                },
                "registered_name": null,
                "name": "input_layer_11",
                "inbound_nodes": []
            },
            {
                "module": "keras.src.models.functional",
                "class_name": "Functional",
                "config": {
                    "name": "MobileNetV3Large",
                    "trainable": false,
                    "layers": [
                        {
                            "module": "keras.layers",
                            "class_name": "InputLayer",
                            "config": {
                                "batch_shape": [
                                    null,
                                    224,
                                    224,
                                    3
                                ],
                                "dtype": "float32",
                                "sparse": false,
                                "name": "input_layer_10"
                            },
                            "registered_name": null,
                            "name": "input_layer_10",
                            "inbound_nodes": []
                        },
                        {
                            "module": "keras.src.ops.core",
                            "class_name": "Cast",
                            "config": {
                                "dtype": "float16"
                            },
                            "registered_name": "Cast",
                            "name": "cast_13",
                            "inbound_nodes": [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    224,
                                                    224,
                                                    3
                                                ],
                                                "dtype": "float32",
                                                "keras_history": [
                                                    "input_layer_10",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "Rescaling",
                            "config": {
                                "name": "rescaling_5",
                                "trainable": false,
                                "dtype": {
                                    "module": "keras",
                                    "class_name": "DTypePolicy",
                                    "config": {
                                        "name": "mixed_float16"
                                    },
                                    "registered_name": null
                                },
                                "scale": 0.00784313725490196,
                                "offset": -1.0
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    224,
                                    224,
                                    3
                                ]
                            },
                            "name": "rescaling_5",
                            "inbound_nodes": [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    224,
                                                    224,
                                                    3
                                                ],
                                                "dtype": "float16",
                                                "keras_history": [
                                                    "cast_13",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv",
                                "trainable": false,
                                "dtype": {
                                    "module": "keras",
                                    "class_name": "DTypePolicy",
                                    "config": {
                                        "name": "mixed_float16"
                                    },
                                    "registered_name": null
                                },
                                "filters": 16,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    2,
                                    2
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "groups": 1,
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    },
                                    "registered_name": null
                                },
                                "bias_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    224,
                                    224,
                                    3
                                ]
                            },
                            "name": "conv",
                            "inbound_nodes": [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    224,
                                                    224,
                                                    3
                                                ],
                                                "dtype": "float16",
                                                "keras_history": [
                                                    "rescaling_5",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "conv_bn",
                                "trainable": false,
                                "dtype": {
                                    "module": "keras",
                                    "class_name": "DTypePolicy",
                                    "config": {
                                        "name": "mixed_float16"
                                    },
                                    "registered_name": null
                                },
                                "axis": -1,
                                "momentum": 0.999,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "gamma_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Ones",
                                    "config": {},
                                    "registered_name": null
                                },
                                "moving_mean_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "moving_variance_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Ones",
                                    "config": {},
                                    "registered_name": null
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null,
                                "synchronized": false
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    112,
                                    112,
                                    16
                                ]
                            },
                            "name": "conv_bn",
                            "inbound_nodes": [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    112,
                                                    112,
                                                    16
                                                ],
                                                "dtype": "float16",
                                                "keras_history": [
                                                    "conv",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {
                                        "mask": null
                                    }
                                }
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "Activation",
                            "config": {
                                "name": "activation_105",
                                "trainable": false,
                                "dtype": {
                                    "module": "keras",
                                    "class_name": "DTypePolicy",
                                    "config": {
                                        "name": "mixed_float16"
                                    },
                                    "registered_name": null
                                },
                                "activation": "hard_silu"
                            },
                            "registered_name": null,
                            "name": "activation_105",
                            "inbound_nodes": [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    112,
                                                    112,
                                                    16
                                                ],
                                                "dtype": "float16",
                                                "keras_history": [
                                                    "conv_bn",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "DepthwiseConv2D",
                            "config": {
                                "name": "expanded_conv_depthwise",
                                "trainable": false,
                                "dtype": {
                                    "module": "keras",
                                    "class_name": "DTypePolicy",
                                    "config": {
                                        "name": "mixed_float16"
                                    },
                                    "registered_name": null
                                },
                                "depth_multiplier": 1,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": false,
                                "depthwise_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    },
                                    "registered_name": null
                                },
                                "bias_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "depthwise_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "depthwise_constraint": null,
                                "bias_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    112,
                                    112,
                                    16
                                ]
                            },
                            "name": "expanded_conv_depthwise",
                            "inbound_nodes": [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    112,
                                                    112,
                                                    16
                                                ],
                                                "dtype": "float16",
                                                "keras_history": [
                                                    "activation_105",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "expanded_conv_depthwise_bn",
                                "trainable": false,
                                "dtype": {
                                    "module": "keras",
                                    "class_name": "DTypePolicy",
                                    "config": {
                                        "name": "mixed_float16"
                                    },
                                    "registered_name": null
                                },
                                "axis": -1,
                                "momentum": 0.999,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "gamma_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Ones",
                                    "config": {},
                                    "registered_name": null
                                },
                                "moving_mean_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "moving_variance_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Ones",
                                    "config": {},
                                    "registered_name": null
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null,
                                "synchronized": false
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    112,
                                    112,
                                    16
                                ]
                            },
                            "name": "expanded_conv_depthwise_bn",
                            "inbound_nodes": [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    112,
                                                    112,
                                                    16
                                                ],
                                                "dtype": "float16",
                                                "keras_history": [
                                                    "expanded_conv_depthwise",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {
                                        "mask": null
                                    }
                                }
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "ReLU",
                            "config": {
                                "name": "re_lu_95",
                                "trainable": false,
                                "dtype": {
                                    "module": "keras",
                                    "class_name": "DTypePolicy",
                                    "config": {
                                        "name": "mixed_float16"
                                    },
                                    "registered_name": null
                                },
                                "max_value": null,
                                "negative_slope": 0.0,
                                "threshold": 0.0
                            },
                            "registered_name": null,
                            "name": "re_lu_95",
                            "inbound_nodes": [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    112,
                                                    112,
                                                    16
                                                ],
                                                "dtype": "float16",
                                                "keras_history": [
                                                    "expanded_conv_depthwise_bn",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "Conv2D",
                            "config": {
                                "name": "expanded_conv_project",
                                "trainable": false,
                                "dtype": {
                                    "module": "keras",
                                    "class_name": "DTypePolicy",
                                    "config": {
                                        "name": "mixed_float16"
                                    },
                                    "registered_name": null
                                },
                                "filters": 16,
                                "kernel_size": [
                                    1,
                                    1
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "groups": 1,
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    },
                                    "registered_name": null
                                },
                                "bias_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    112,
                                    112,
                                    16
                                ]
                            },
                            "name": "expanded_conv_project",
                            "inbound_nodes": [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    112,
                                                    112,
                                                    16
                                                ],
                                                "dtype": "float16",
                                                "keras_history": [
                                                    "re_lu_95",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "expanded_conv_project_bn",
                                "trainable": false,
                                "dtype": {
                                    "module": "keras",
                                    "class_name": "DTypePolicy",
                                    "config": {
                                        "name": "mixed_float16"
                                    },
                                    "registered_name": null
                                },
                                "axis": -1,
                                "momentum": 0.999,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "gamma_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Ones",
                                    "config": {},
                                    "registered_name": null
                                },
                                "moving_mean_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "moving_variance_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Ones",
                                    "config": {},
                                    "registered_name": null
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null,
                                "synchronized": false
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    112,
                                    112,
                                    16
                                ]
                            },
                            "name": "expanded_conv_project_bn",
                            "inbound_nodes": [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    112,
                                                    112,
                                                    16
                                                ],
                                                "dtype": "float16",
                                                "keras_history": [
                                                    "expanded_conv_project",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {
                                        "mask": null
                                    }
                                }
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "Add",
                            "config": {
                                "name": "expanded_conv_add",
                                "trainable": false,
                                "dtype": {
                                    "module": "keras",
                                    "class_name": "DTypePolicy",
                                    "config": {
                                        "name": "mixed_float16"
                                    },
                                    "registered_name": null
                                }
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    [
                                        null,
                                        112,
                                        112,
                                        16
                                    ],
                                    [
                                        null,
                                        112,
                                        112,
                                        16
                                    ]
                                ]
                            },
                            "name": "expanded_conv_add",
                            "inbound_nodes": [
                                {
                                    "args": [
                                        [
                                            {
                                                "class_name": "__keras_tensor__",
                                                "config": {
                                                    "shape": [
                                                        null,
                                                        112,
                                                        112,
                                                        16
                                                    ],
                                                    "dtype": "float16",
                                                    "keras_history": [
                                                        "activation_105",
                                                        0,
                                                        0
                                                    ]
                                                }
                                            },
                                            {
                                                "class_name": "__keras_tensor__",
                                                "config": {
                                                    "shape": [
                                                        null,
                                                        112,
                                                        112,
                                                        16
                                                    ],
                                                    "dtype": "float16",
                                                    "keras_history": [
                                                        "expanded_conv_project_bn",
                                                        0,
                                                        0
                                                    ]
                                                }
                                            }
                                        ]
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "Conv2D",
                            "config": {
                                "name": "expanded_conv_1_expand",
                                "trainable": false,
                                "dtype": {
                                    "module": "keras",
                                    "class_name": "DTypePolicy",
                                    "config": {
                                        "name": "mixed_float16"
                                    },
                                    "registered_name": null
                                },
                                "filters": 64,
                                "kernel_size": [
                                    1,
                                    1
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "groups": 1,
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    },
                                    "registered_name": null
                                },
                                "bias_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    112,
                                    112,
                                    16
                                ]
                            },
                            "name": "expanded_conv_1_expand",
                            "inbound_nodes": [
                                {
                                    "args": [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    112,
                                                    112,
                                                    16
                                                ],
                                                "dtype": "float16",
                                                "keras_history": [
                                                    "expanded_conv_add",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ],
                                    "kwargs": {}
                                }
                            ]
                        },
                        {
                            "module": "keras.layers",
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "expanded_conv_1_expand_bn",
                                "trainable": false,
                                "dtype": {
                                    "module": "keras",
                                    "class_name": "DTypePolicy",
                                    "config": {
                                        "name": "mixed_float16"
                                    },
                                    "registered_name": null
                                },
                                "axis": -1,
                                "momentum": 0.999,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "gamma_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Ones",
                                    "config": {},
                                    "registered_name": null
                                },
                                "moving_mean_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Zeros",
                                    "config": {},
                                    "registered_name": null
                                },
                                "moving_variance_initializer": {
                                    "module": "keras.initializers",
                                    "class_name": "Ones",
                                    "config": {},
                                    "registered_name": null
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null,
                                "synchronized": false
                            },
                            "registered_name": null,
                            "build_config": {
                                "input_shape": [
                                    null,
                                    112,
                                    112,
                                    64
